garyPenhook/PyAvrOCD/svd/atmega809.svd
        <register>
          <name>WINLT</name>
          <description>Window comparator low threshold</description>
          <addressOffset>0x12</addressOffset>
          <size>0x10</size>
          <access>read-write</access>
          <writeConstraint>
            <range>
              <minimum>0</minimum>
              <maximum>65535</maximum>
            </range>
          </writeConstraint>
        </register>
      </registers>
    </peripheral>
    <peripheral>
      <name>BOD</name>
      <description>Bod interface</description>
      <baseAddress>0x00800080</baseAddress>
      <addressBlock>
        <offset>0x0</offset>
        <size>0x2</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x8</offset>
        <size>0x4</size>
        <usage>registers</usage>
      </addressBlock>
      <registers>
        <register>
          <name>CTRLA</name>
          <description>Control A</description>
          <addressOffset>0x0</addressOffset>
          <size>0x8</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>SLEEP</name>
              <description>Operation in sleep mode</description>
              <bitRange>[1:0]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DIS</name>
                  <description>Disabled</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENABLED</name>
                  <description>Enabled</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SAMPLED</name>
                  <description>Sampled</description>
                  <value>2</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>ACTIVE</name>
              <description>Operation in active mode</description>
              <bitRange>[3:2]</bitRange>
              <access>read-only</access>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DIS</name>
                  <description>Disabled</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENABLED</name>
                  <description>Enabled</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SAMPLED</name>
                  <description>Sampled</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENWAKE</name>
                  <description>Enabled with wake-up halted until BOD is ready</description>
                  <value>3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SAMPFREQ</name>
              <description>Sample frequency</description>
              <bitRange>[4:4]</bitRange>
              <access>read-only</access>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>1KHZ</name>
                  <description>1kHz sampling frequency</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>125HZ</name>
                  <description>125Hz sampling frequency</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>CTRLB</name>
          <description>Control B</description>
          <addressOffset>0x1</addressOffset>
          <size>0x8</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>LVL</name>
              <description>Bod level</description>
              <bitRange>[2:0]</bitRange>
              <access>read-only</access>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>BODLEVEL0</name>
                  <description>1.8 V</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>BODLEVEL2</name>
                  <description>2.6 V</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>BODLEVEL7</name>
                  <description>4.2 V</description>
                  <value>7</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>INTCTRL</name>
          <description>Voltage level monitor interrupt Control</description>
          <addressOffset>0x9</addressOffset>
          <size>0x8</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>VLMIE</name>
              <description>voltage level monitor interrrupt enable</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>VLMCFG</name>
              <description>Configuration</description>
              <bitRange>[2:1]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>BELOW</name>
                  <description>Interrupt when supply goes below VLM level</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ABOVE</name>
                  <description>Interrupt when supply goes above VLM level</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CROSS</name>
                  <description>Interrupt when supply crosses VLM level</description>
                  <value>2</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>INTFLAGS</name>
          <description>Voltage level monitor interrupt Flags</description>
          <addressOffset>0xA</addressOffset>
          <size>0x8</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>VLMIF</name>
              <description>Voltage level monitor interrupt flag</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>STATUS</name>
          <description>Voltage level monitor status</description>
          <addressOffset>0xB</addressOffset>
          <size>0x8</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>VLMS</name>
              <description>Voltage level monitor status</description>
              <bitRange>[0:0]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>VLMCTRLA</name>
          <description>Voltage level monitor Control</description>
          <addressOffset>0x8</addressOffset>
          <size>0x8</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>VLMLVL</name>
              <description>voltage level monitor level</description>
              <bitRange>[1:0]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>5ABOVE</name>
                  <description>VLM threshold 5% above BOD level</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>15ABOVE</name>
                  <description>VLM threshold 15% above BOD level</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>25ABOVE</name>
                  <description>VLM threshold 25% above BOD level</description>
                  <value>2</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
