garyPenhook/PyAvrOCD/svd/atmega809.svd
        <register>
          <name>USERTCB2</name>
          <description>User TCB2</description>
          <addressOffset>0x36</addressOffset>
          <size>0x8</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>CHANNEL</name>
              <description>Channel selector</description>
              <bitRange>[7:0]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>OFF</name>
                  <description>Off</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CHANNEL0</name>
                  <description>Connect user to event channel 0</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CHANNEL1</name>
                  <description>Connect user to event channel 1</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CHANNEL2</name>
                  <description>Connect user to event channel 2</description>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CHANNEL3</name>
                  <description>Connect user to event channel 3</description>
                  <value>4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CHANNEL4</name>
                  <description>Connect user to event channel 4</description>
                  <value>5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CHANNEL5</name>
                  <description>Connect user to event channel 5</description>
                  <value>6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CHANNEL6</name>
                  <description>Connect user to event channel 6</description>
                  <value>7</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CHANNEL7</name>
                  <description>Connect user to event channel 7</description>
                  <value>8</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>USERTCB3</name>
          <description>User TCB3</description>
          <addressOffset>0x37</addressOffset>
          <size>0x8</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>CHANNEL</name>
              <description>Channel selector</description>
              <bitRange>[7:0]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>OFF</name>
                  <description>Off</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CHANNEL0</name>
                  <description>Connect user to event channel 0</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CHANNEL1</name>
                  <description>Connect user to event channel 1</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CHANNEL2</name>
                  <description>Connect user to event channel 2</description>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CHANNEL3</name>
                  <description>Connect user to event channel 3</description>
                  <value>4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CHANNEL4</name>
                  <description>Connect user to event channel 4</description>
                  <value>5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CHANNEL5</name>
                  <description>Connect user to event channel 5</description>
                  <value>6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CHANNEL6</name>
                  <description>Connect user to event channel 6</description>
                  <value>7</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CHANNEL7</name>
                  <description>Connect user to event channel 7</description>
                  <value>8</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>USERUSART0</name>
          <description>User USART0</description>
          <addressOffset>0x2F</addressOffset>
          <size>0x8</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>CHANNEL</name>
              <description>Channel selector</description>
              <bitRange>[7:0]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>OFF</name>
                  <description>Off</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CHANNEL0</name>
                  <description>Connect user to event channel 0</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CHANNEL1</name>
                  <description>Connect user to event channel 1</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CHANNEL2</name>
                  <description>Connect user to event channel 2</description>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CHANNEL3</name>
                  <description>Connect user to event channel 3</description>
                  <value>4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CHANNEL4</name>
                  <description>Connect user to event channel 4</description>
                  <value>5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CHANNEL5</name>
                  <description>Connect user to event channel 5</description>
                  <value>6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CHANNEL6</name>
                  <description>Connect user to event channel 6</description>
                  <value>7</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CHANNEL7</name>
                  <description>Connect user to event channel 7</description>
                  <value>8</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>USERUSART1</name>
          <description>User USART1</description>
          <addressOffset>0x30</addressOffset>
          <size>0x8</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>CHANNEL</name>
              <description>Channel selector</description>
              <bitRange>[7:0]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>OFF</name>
                  <description>Off</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CHANNEL0</name>
                  <description>Connect user to event channel 0</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CHANNEL1</name>
                  <description>Connect user to event channel 1</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CHANNEL2</name>
                  <description>Connect user to event channel 2</description>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CHANNEL3</name>
                  <description>Connect user to event channel 3</description>
                  <value>4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CHANNEL4</name>
                  <description>Connect user to event channel 4</description>
                  <value>5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CHANNEL5</name>
                  <description>Connect user to event channel 5</description>
                  <value>6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CHANNEL6</name>
                  <description>Connect user to event channel 6</description>
                  <value>7</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CHANNEL7</name>
                  <description>Connect user to event channel 7</description>
                  <value>8</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>USERUSART2</name>
          <description>User USART2</description>
          <addressOffset>0x31</addressOffset>
          <size>0x8</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>CHANNEL</name>
              <description>Channel selector</description>
              <bitRange>[7:0]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>OFF</name>
                  <description>Off</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CHANNEL0</name>
                  <description>Connect user to event channel 0</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CHANNEL1</name>
                  <description>Connect user to event channel 1</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CHANNEL2</name>
                  <description>Connect user to event channel 2</description>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CHANNEL3</name>
                  <description>Connect user to event channel 3</description>
                  <value>4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CHANNEL4</name>
                  <description>Connect user to event channel 4</description>
                  <value>5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CHANNEL5</name>
                  <description>Connect user to event channel 5</description>
                  <value>6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CHANNEL6</name>
                  <description>Connect user to event channel 6</description>
                  <value>7</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CHANNEL7</name>
                  <description>Connect user to event channel 7</description>
                  <value>8</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>USERUSART3</name>
          <description>User USART3</description>
          <addressOffset>0x32</addressOffset>
          <size>0x8</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>CHANNEL</name>
              <description>Channel selector</description>
              <bitRange>[7:0]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>OFF</name>
                  <description>Off</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CHANNEL0</name>
                  <description>Connect user to event channel 0</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CHANNEL1</name>
                  <description>Connect user to event channel 1</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CHANNEL2</name>
                  <description>Connect user to event channel 2</description>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CHANNEL3</name>
                  <description>Connect user to event channel 3</description>
                  <value>4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CHANNEL4</name>
                  <description>Connect user to event channel 4</description>
                  <value>5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CHANNEL5</name>
                  <description>Connect user to event channel 5</description>
                  <value>6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CHANNEL6</name>
                  <description>Connect user to event channel 6</description>
                  <value>7</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CHANNEL7</name>
                  <description>Connect user to event channel 7</description>
                  <value>8</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
